Revit 2025 API
Zone.CoolingAirTemperature Property
Get or set the Cooling Air Temperature of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double CoolingAirTemperature { get; set; }
Public Property CoolingAirTemperature As Double
	Get
	Set
public:
property double CoolingAirTemperature {
	double get ();
	void set (double value);
}
member CoolingAirTemperature : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Cooling Air Temperature of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace